{
    "Hola, soy Jorge.": "Hi, I'm Jorge.",
    "Desarrollador de FrontEnd": "FrontEnd Developer",
    "Sobre mí": "About me",
    "Partiendo de la base de HTML, CSS Y JavaScript me especializado en la creación de aplicaciones con React. Me considero una persona autodidacta y comprometida, con capacidad para el aprendizaje y el trabajo en equipo." : "Starting from the basics of HTML, CSS, and JavaScript, I have specialized in creating applications with React. I consider myself a self-taught and committed person, with the ability to learn and work in a team.",
    "Si quieres saber más no dudes en descargar mi currículum." : "If you want to know more, don't hesitate to download my Cv.",
    "Descargar Cv" : "Download Cv",
    "Experiencia" : "Experience",
    "Mi área principal de especialización es el desarrollo Frontend pero mi formación es FullStack. Partiendo de la base de HTML, CSS y JavaScript me he especializado en la creación de aplicaciones con React.": "My main area of specialization is Frontend development, but my training is FullStack. Starting with HTML, CSS, and JavaScript, I have specialized in creating applications with React.",
    "Creación de aplicaciones web con React y Vite, gestión de estados globales con Redux Toolkit y tipado con TypeScript. Gestión de la información en tiempo real con WebSockets. Diseño responsive con CSS y uso de frameworks y librerías como Tailwind, Bootstrap o Mui. Creación de prototipos basados en principios UX/UI con Figma. Manejo de Backend con Node y Express, bases de datos con MySql, conocimientos de API REST. Control de versiones con Git." : "Web application development with React and Vite, global state management with Redux Toolkit, and typing with TypeScript. Real-time information management with WebSockets. Responsive design with CSS and use of frameworks and libraries such as Tailwind, Bootstrap, or MUI. Prototyping based on UX/UI principles with Figma. Backend handling with Node and Express, databases with MySQL, knowledge of REST APIs. Version control with Git.",
    "Nombre" : "Name",
    "Email" : "Email",
    "Mensaje" : "Message",
    "Enviar" : "Send",
    "Mensaje enviado con éxito" : "Message sent successfully",
    "Home" : "Home",
    "Contacto" : "Contact",
    "Tecnologías" : "Technologies",
    "Campo inválido." : "Invalid field.",
    " El nombre no puede estar vacío." : " The name cannot be empty.",
    " El mensaje no puede estar vacío." : " The message cannot be empty.",
    " Asegúrese de que tiene formato de Email." : " Make sure the email format is correct.",
    "Política de privacidad" : "Privacy Policy",
    "De conformidad con lo establecido en la Ley de Protección de Datos de Carácter Personal y Reglamento UE 2016/679, en caso de que nos envíe algún correo electrónico a la dirección indicada en la misma, o rellene algún formulario de recogida de datos, le informamos de que los datos de carácter personal que nos proporcione, serán registrados en el fichero del que es responsable jorgenovorodriguez.netlify.app, con la finalidad de gestionar su consulta." : "In accordance with the provisions of the Personal Data Protection Law and EU Regulation 2016/679, in the event that you send us an email to the address indicated, or fill out a data collection form, we inform you that the personal data you provide will be registered in the file for which jorgenovorodriguez.netlify.app is responsible, with the purpose of managing your inquiry.",
    "Comencé mi formación de manera autodidácta, pasando luego a hacer un bootcamp de programación web en Hack a Boss. Por suerte he podido seguir ampliando mis conocimientos gracias a mi experiencia laboral, donde me he encontrado con compañeros de los que he aprendido mucho.": "I started my training in a self-taught way, later attending a web programming bootcamp at Hack a Boss. Fortunately, I have been able to continue expanding my knowledge thanks to my work experience, where I have met colleagues from whom I have learned a lot.",
    "Ese es mi perfil de linkedIn." : "This is my LinkedIn profile.",
    "Ese es mi email, puedes escribirme cuando quieras." : "This is my email, you can write to me anytime.",
    "Desarrollo de FrontEnd:": "Frontend Development:",
    "Tecnologías en Tiempo Real:": "Real-Time Technologies:",
    "Diseño y Prototipado:": "Design and Prototyping:",
    "Desarrollo BackEnd:": "Backend Development:",
    "Control de Versiones:": "Version Control:",
    "Creación de soluciones dinámicas y eficientes utilizando React y Vite. Gestión de estados globales con Redux Toolkit y tipado robusto a través de TypeScript.": "Creation of dynamic and efficient solutions using React and Vite. Management of global states with Redux Toolkit and robust typing through TypeScript.",
    "Integración de WebSockets para la gestión y actualización de información en tiempo real.": "Integration of WebSockets for managing and updating real-time information.",
    "Diseño de interfaces responsivas mediante CSS y frameworks como Tailwind, Bootstrap y Material-UI (Mui). Prototipado basado en principios de UX/UI con Figma para garantizar una experiencia de usuario fluida.": "Design of responsive interfaces using CSS and frameworks such as Tailwind, Bootstrap, and Material-UI (Mui). Prototyping based on UX/UI principles with Figma to ensure a smooth user experience.",
    "Manejo de Node.js y Express para construir APIs eficientes, trabajando con bases de datos MySQL y aplicando principios de diseño de API REST. Uso de Postman para la prueba y documentación de APIs.": "Using Node.js and Express to build efficient APIs, working with MySQL databases and applying REST API design principles. Using Postman for testing and documenting APIs.",
    "Uso de Git para el control de versiones, facilitando la colaboración y el seguimiento de cambios en el código.": "Using Git for version control, facilitating collaboration and tracking changes in the code.",
    "Utilización de herramientas como Jira para la documentación de proyectos y el seguimiento de tareas, asegurando una comunicación efectiva dentro del equipo.": "Utilization of tools like Jira for project documentation and task tracking, ensuring effective communication within the team.",
    "Referencias" : "References",
    "Proyectos" : "Projects",
    "Portfolio": "Portfolio",
    "Proyecto personal": "Personal Project",
    "En este proyecto he tratado de crear un portfolio sencillo que me sirva como muestra de cara a la búsqueda de empleo. La parte de backend ha sido desarrollada con Node.js, consta de un pequeño servidor conectado a una base de datos MySql. En la parte de front se ha utilizado React y TypeScript con Css Modules. He utilizado Netlify para el despliegue del front y Railway para el despliegue del back.": "In this project, I tried to create a simple portfolio to serve as a showcase for my job search. The backend has been developed with Node.js and consists of a small server connected to a MySQL database. On the frontend, React and TypeScript with CSS Modules have been used. I used Netlify for the frontend deployment and Railway for the backend deployment.",
    "Gestión industrial": "Industrial Management",
    "Proyecto profesional, no puedo dar muchos detalles ni mostrar código por compromiso de confidencialidad. La finalidad de la aplicación es optimizar los procesos internos de instalaciones de frío industrial y comercial. En front usamos React con CSS, librerías de distintos tipos, servicios de geolocalización, consumo de servicios de IA en Python, y servicios de back en Java.": "Professional project, I can't provide many details or show code due to confidentiality commitments. The purpose of the application is to optimize internal processes for industrial and commercial refrigeration installations. On the frontend, we used React with CSS, various libraries, geolocation services, AI services in Python, and backend services in Java.",
    "Administración": "Administration",
    "Proyecto profesional, no puedo dar muchos detalles ni mostrar código por compromiso de confidencialidad. En este caso el proyecto consiste en una app de uso interno para poder dar de alta y administrar las instalaciones anteriormente mencionadas. En front usamos React con CSS, librerías de distintos tipos, consumo de servicios de IA en Python, y servicios de back en Java.": "Professional project, I can't provide many details or show code due to confidentiality commitments. In this case, the project consists of an internal app to register and manage the aforementioned installations. On the frontend, we used React with CSS, various libraries, AI services in Python, and backend services in Java.",
    "Callcenter": "Call Center",
    "Proyecto profesional, no puedo dar muchos detalles ni mostrar código por compromiso de confidencialidad. En este caso el proyecto consiste en una app gestionar incidencias en un Callcenter. En front usamos React con CSS, Tailwind, comunicación con WebSockets, consumo de servicios de IA en Python, y servicios de back en Java.": "Professional project, I can't provide many details or show code due to confidentiality commitments. In this case, the project consists of an app to manage incidents in a call center. On the frontend, we used React with CSS, Tailwind, WebSocket communication, AI services in Python, and backend services in Java.",
    "Red Social": "Social Network",
    "Proyecto final de Bootcamp, se trata de una red social donde los usuarios pueden interactuar de diversas formas. La idea era crear un app donde se pudieran poner en contacto tatuadores y estudios. Los usuarios tienen roles, pueden publicar fotos o vídeos para mostrar su trabajo, añadiendo ubicación, categorías... Para el backend se usó Node y Express conectado a una base de datos MySql, en la parte de frontend se usó React con CSS.": "Final Bootcamp project, this is a social network where users can interact in various ways. The idea was to create an app for tattoo artists and studios to get in touch. Users have roles and can post photos or videos to showcase their work, adding location, categories, etc. For the backend, Node and Express connected to a MySQL database were used, and for the frontend, React with CSS.",
    "Facturador": "Invoicing System",
    "Proyecto formativo. Aplicación que permite interactuar con facturas (creación, edición, listados... etc). Contiene servicio de autentificación y uso de metadata. La intención fue mejorar el uso de Next. Se usó tipado con TypeScript, estilos con Tailwind y base de datos MySql. Despliegue en Vercel.": "Training project. An application that allows interaction with invoices (creation, editing, listings, etc.). It includes an authentication service and metadata usage. The goal was to improve the use of Next.js. Typed with TypeScript, styled with Tailwind, and using a MySQL database. Deployed on Vercel.",
    "Error desconocido" : "Unknown error",
    "useError debe ser usado dentro de un ErrorProvider" : "useError must be used within an ErrorProvider",
    "Error al obtener los datos de experiencia" : "Error fetching experience data",
    "Error al obtener los proyectos" : "Error fetching projects",
    "Error al enviar el mensaje" : "Error sending the message",
    "Email guardado en el portapapeles" : "Email saved to clipboard.",
    "Error al abrir el enlace" : "Error opening the link."
}